Autodesk.Revit.DB.SlabShapeCreaseType
An enumerated type listing all Crease types of Slab Shape Edit.

Autodesk.Revit.DB.SlabShapeCreaseType.Auto
The type of Crease is Auto.

Autodesk.Revit.DB.SlabShapeCreaseType.UserDrawn
The type of Crease is UserDrawn.

Autodesk.Revit.DB.SlabShapeCreaseType.Boundary
The type of Crease is Boundary.

Autodesk.Revit.DB.SlabShapeCreaseType.Invalid
The type of Crease is Invalid.